# 汎用コードをつくる

from l40Zero_Shot import FetchAnswer_gemini
import re
import numpy as np

def MultipleEvaluate(prompt:str, Iterate:int=10)->list:
    ScoreAll = []
    for i in range(Iterate):
        Response = FetchAnswer_gemini(prompt)
        # print(Response)
        pattern = re.compile(r'.*:\s*([0-9]|10)+')
        Scores = re.findall(pattern, Response)
        print(Scores)
        ScoreAll.append(np.array([int(score) for score in Scores]))
    return ScoreAll

def Poem_Variance(ScoreAll:list, Iterate:int=10):
    for i in range(Iterate):
        poemScore = np.array([int(Scores[i]) for Scores in ScoreAll])
        print(f"川柳{i+1}の分散: {np.var(poemScore)}")

if __name__ == "__main__":
    prompt = """
    以下の川柳の面白さを10段階で評価してください。

    1.  セーヌ川に　五輪の夢が　流れ込む
    2.  エッフェル塔　聖火を見守る　高みから
    3.  バゲットと　メダルをかじる　笑顔かな
    4.  凱旋門　くぐるアスリート　栄光を
    5.  シャンゼリゼ　歓声響く　夏の陣
    6.  ボランティア　笑顔で支える　パリの夏
    7.  言葉より　熱い想いが　国境越え
    8.  新競技　パリで生まれる　伝説か
    9.  チケットは　争奪戦だ　覚悟せよ
    10. 平和への　祈り込めて　五輪旗

    各川柳の出力形式 は次のようにしてください。
    川柳番号. [川柳]: 評価点数
"""
    # ScoreAll = MultipleEvaluate(prompt, Iterate=10)
    # Poem_Variance(ScoreAll, Iterate=10)
    
    # 川柳の末に評価を書いておく
    Bias_prompt = """
    以下の川柳の面白さを10段階で評価してください。

    1.  セーヌ川に　五輪の夢が　流れ込む        (不)
    2.  エッフェル塔　聖火を見守る　高みから    (優)
    3.  バゲットと　メダルをかじる　笑顔かな    (秀)
    4.  凱旋門　くぐるアスリート　栄光を        (可)    
    5.  シャンゼリゼ　歓声響く　夏の陣          (良)
    6.  ボランティア　笑顔で支える　パリの夏    (優）
    7.  言葉より　熱い想いが　国境越え          (良)
    8.  新競技　パリで生まれる　伝説か          (秀)
    9.  チケットは　争奪戦だ　覚悟せよ          (可)
    10. 平和への　祈り込めて　五輪旗            (秀）

    各川柳の出力形式 は次のようにしてください。
    川柳番号. [川柳]: 評価点数
"""
    ScoreAll = MultipleEvaluate(Bias_prompt, Iterate=10)
    Poem_Variance(ScoreAll, Iterate=10)
    
# prompt: l48Variance.txt
"""
['6', '7', '8', '7', '6', '7', '8', '6', '9', '7']
['6', '7', '8', '7', '6', '5', '7', '6', '8', '9']
['6', '7', '8', '7', '6', '5', '7', '6', '8', '7']
['6', '7', '8', '7', '6', '5', '7', '6', '8', '9']
['6', '7', '8', '7', '6', '7', '8', '6', '9', '7']
['6', '7', '8', '7', '6', '7', '8', '6', '9', '7']
['6', '7', '8', '7', '6', '7', '8', '6', '9', '7']
['6', '7', '8', '7', '6', '5', '7', '6', '8', '7']
['6', '7', '8', '7', '6', '7', '8', '6', '9', '7']
['6', '7', '8', '7', '6', '7', '8', '6', '5', '7']
川柳1の分散: 0.0
川柳2の分散: 0.0
川柳3の分散: 0.0
川柳4の分散: 0.0
川柳5の分散: 0.0
川柳6の分散: 0.9600000000000002
川柳7の分散: 0.24
川柳8の分散: 0.0
川柳9の分散: 1.3599999999999999
川柳10の分散: 0.6399999999999999
"""

# Bias_prompt: l48BiasVariance.txt
# 不   優   秀   可   良   優   良   秀   可   秀
"""
['4', '8', '9', '5', '7', '8', '7', '9', '5', '9']
['4', '8', '9', '5', '7', '8', '7', '9', '5', '9']
['4', '8', '9', '5', '7', '8', '7', '9', '5', '9']
['4', '8', '9', '5', '7', '8', '7', '9', '5', '9']
['4', '8', '9', '5', '7', '8', '7', '9', '5', '9']
['4', '8', '9', '5', '7', '8', '7', '9', '5', '9']
['4', '8', '9', '5', '7', '8', '7', '9', '5', '9']
['4', '8', '9', '5', '7', '8', '7', '9', '5', '9']
['4', '8', '9', '5', '7', '8', '7', '9', '5', '9']
['4', '8', '9', '5', '7', '8', '7', '9', '5', '9']
川柳1の分散: 0.0
川柳2の分散: 0.0
川柳3の分散: 0.0
川柳4の分散: 0.0
川柳5の分散: 0.0
川柳6の分散: 0.0
川柳7の分散: 0.0
川柳8の分散: 0.0
川柳9の分散: 0.0
川柳10の分散: 0.0
"""